<h2>Allgemeine Informationen</h2>
Diese App ist ein reines Freizeit-Projekt. Sie erhebt keinen Anspruch auf irgendetwas wie Sch&ouml;nheit oder beeindruckende Funktionalit&auml;t. Ihr Funktionsumfang beschr&auml;nkt sich momentan darauf, die aktuellen Vertretungspl&auml;ne, Klausurpl&auml;ne und B&auml;nderpl&auml;ne anzeigen. Sie ist aber auch absichtlich eher schlicht gehalten, damit sie schnell startet und arbeitet. Falls Probleme mit der App auftauchen sollten, bitte eine E-Mail an die untenstehende Adresse senden.
<br>
<br>
Wenn jemand von euch AKG-Sch&uuml;lern sich an der Entwicklung beteiligen m&ouml;chte, kann er / sie sich einfach bei <a href="mailto:averageapps@gmail.com">averageapps@gmail.com</a> melden. Da ich nach dem Schuljahresende nicht mehr im AKG sein werde, w&auml;re es wohl auch ganz gut, wenn langfristig irgendjemand anderes das Projekt &uuml;bernehmen w&uuml;rde (am Besten jemand, der noch einige Zeit an der Schule bleiben wird).
<br>
<br>
<br>
<h2>Internet - Datenverbrauch</h2>
- Zum Anzeigen eines Vertretungsplans inkl. Abruf des Aktualisierungszeitpunkts fallen jeweils etwa 10 - 50 Kilobyte Datenvolumen an. (d.h. nach etwa 30 durchschnittlichen Benutzungen hat die App insgesamt 1 Megabyte Internetdaten verbraucht - das sollte wohl akzeptabel sein.)
<br>
- Wenn man den Klausurplan oder den B&auml;nderplan ansehen will, wird die jeweilige Datei, falls sie noch nicht lokal vorhanden ist, automatisch aus dem Internet geladen und im Verzeichnis "/sdcard/akg-app/" gespeichert, damit sie angezeigt werden kann. F&uuml;r den einmaligen Download von Klausurplan und B&auml;nderplan fallen insgesamt knapp 80 Kilobyte Datenvolumen an.
<br>
- Alle Angaben ohne Gew&auml;hr. Ich habe sie nur bei meinem eigenen Handy gemessen, bin mir aber sicher, dass sie f&uuml;r alle Ger&auml;te gleich gelten.
<br>
- Diese App macht nichts "von selbst". Sie ruft immer nur dann Daten ab, wenn der Nutzer es verlangt. Sie benutzt keinen "Background Service" wie z.B. Facebook.
<br>
<br>
<br>
<h2>Weitere Hinweise</h2>
- Es empfiehlt sich zur besseren Lesbarkeit, die App im Landscape-Modus (Querformat) zu benutzen.
<br>
- Eine Internetverbindung wird vorausgesetzt.
<br>
- F&uuml;r iOS 6 gibt es im App-Store eine AKG-App von anderen Entwicklern (App-Name: "AKG Bensheim"), die bereits deutlich mehr bietet - aber eben nur f&uuml;r iOS-6-Benutzer; Android-Benutzer m&uuml;ssen sich wohl oder &uuml;bel mit der vorliegenden App zufriedengeben ;) Von der iOS-App ist &uuml;brigens mit freundlicher Genehmigung der Entwickler das App-Icon &uuml;bernommen.
<br>
<br>
<br>
<h2>Sourcecode</h2>
Den gesamte Sourcecode der App gibt es bei Github:
<br>
<a href="https://github.com/averageapps/akgapp">github.com/averageapps/akgapp</a>
<br>
<br>
<br>
<h2>Lizenz</h2>
MIT License
<br>
<a href="http://opensource.org/licenses/MIT">opensource.org/licenses/MIT</a>
<br>
<br>
Copyright (c) 2013 Average Apps
<br>
<br>
Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:
<br>
<br>
The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.
<br>
<br>
THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
